a = int(input('Входные данные: '))
b = a  + 1
c = b + 1
print(a, b, c, sep='\n')