nn = int(input('Входные данные: '))
if nn % 2 == 0:
    print('Вывод: ', nn // 2)
else:
    print('Вывод: ', nn // 2 + 1)