print('Введите данные последовательно:')
a = int(input('Входные данные: '))
b = int(input('Входные данные: '))
c = int(input('Входные данные: '))
d = (a + b + c)
v = (a * b * c)
print('Вывод: ', d)
print('Вывод: ', v)