a = int(input('Входные данные: '))
b = a //10
print(b)