a = int(input('Входные данные: '))
v = a ** 3
s = 6 * a ** 2
print('Вывод: ', v)
print('Вывод: ', s)