a = int(input('Входные данные: '))
b = a + 1
print('Следующее за числом', a, 'число:', b)
c = a - 1
print('Для числа', a, 'предыдущее число:', c)