a = int(input('Входные данные: '))
b = int(input('Входные данные: '))
c = int(input('Входные данные: '))
v = int(input('Входные данные: '))
print(a + b + c + v)