a_1 = int(input('Входные данные: '))
d = int(input('Входные данные: '))
n = int(input('Входные данные: '))
def a_n(a_1, d, n):
    c = a_1 + d * (n - 1)
    print('Вывод: ',c)
a_n(a_1, d, n)